CrinitusFeles/STM32_LoRa_V3.1/Periph/inc/l431_gpio_alt_func.h
#define PA0_TIM2_CH1				AF1
#define PA0_USART2_CTS				AF7
#define PA0_COMP1_OUT				AF12
#define PA0_SAI1_EXTCLK				AF13
#define PA0_TIM2_ETR				AF14

#define PA1_TIM2_CH2				AF1
#define PA1_I2C1_SMBA				AF4
#define PA1_SPI1_SCK				AF5
#define PA1_USART2_RTS_DE			AF7
#define PA1_TIM15_CH1N				AF14

#define PA2_TIM2_CH3				AF1
#define PA2_USART2_TX				AF7
#define PA2_LPUART1_TX				AF8
#define PA2_QUADSPI_BK1_NCS			AF10
#define PA2_COMP2_OUT				AF12
#define PA2_TIM15_CH1				AF14

#define PA3_TIM2_CH4				AF1
#define PA3_USART2_RX				AF7
#define PA3_LPUART1_RX				AF8
#define PA3_QUADSPI_CLK				AF10
#define PA3_SAI1_MCLK_A				AF13
#define PA3_TIM15_CH2				AF14

#define PA4_SPI1_NSS				AF5
#define PA4_SPI3_NSS				AF6
#define PA4_USART2_CK				AF7
#define PA4_SAI1_FS_B				AF13
#define PA4_LPTIM2_OUT				AF14

#define PA5_TIM2_CH1				AF1
#define PA5_TIM2_ETR				AF2
#define PA5_SPI1_SCK				AF5
#define PA5_LPTIM2_ETR				AF14

#define PA6_TIM1_BKIN				AF1
#define PA6_SPI1_MISO				AF5
#define PA6_COMP1_OUT				AF6
#define PA6_USART3_CTS				AF7
#define PA6_LPUART1_CTS				AF8
#define PA6_QUADSPI_BK1_IO3			AF10
#define PA6_TIM1_BKIN_COMP2			AF12
#define PA6_TIM16_CH1				AF14

#define PA7_TIM1_CH1N				AF1
#define PA7_I2C3_SCL				AF4
#define PA7_SPI1_MOSI				AF5
#define PA7_QUADSPI_BK1_IO2			AF10
#define PA7_COMP2_OUT				AF12

#define PA8_MCO						AF0
#define PA8_TIM1_CH1				AF1
#define PA8_USART1_CK				AF7
#define PA8_SWPMI1_IO				AF12
#define PA8_SAI1_SCK_A				AF13
#define PA8_LPTIM2_OUT				AF14

#define PA9_TIM1_CH2				AF1
#define PA9_I2C1_SCL				AF4
#define PA9_USART1_TX				AF7
#define PA9_SAI1_FS_A				AF13
#define PA9_TIM15_BKIN				AF14

#define PA10_TIM1_CH3				AF1
#define PA10_I2C1_SDA				AF4
#define PA10_USART1_RX				AF7
#define PA10_SAI1_SD_A				AF13

#define PA11_TIM1_CH4				AF1
#define PA11_TIM1_BKIN2				AF2
#define PA11_SPI1_MISO				AF5
#define PA11_COMP1_OUT				AF6
#define PA11_USART1_CTS				AF7
#define PA11_CAN1_RX				AF9
#define PA11_TIM1_BKIN2_COMP1		AF12

#define PA12_TIM1_ETR				AF1
#define PA12_SPI1_MOSI				AF5
#define PA12_USART1_RTS_DE			AF7
#define PA12_CAN1_TX				AF9

#define PA13_JTMS_SWDIO				AF0
#define PA13_IR_OUT					AF1
#define PA13_SWPMI1_TX				AF12
#define PA13_SAI1_SD_B				AF13

#define PA14_JTCK_SWCLK				AF0
#define PA14_LPTIM1_OUT				AF1
#define PA14_I2C1_SMBA				AF4
#define PA14_SWPMI1_RX				AF12
#define PA14_SAI1_FS_B				AF13

#define PA15_JTDI					AF0
#define PA15_TIM2_CH1				AF1
#define PA15_TIM2_ETR				AF2
#define PA15_USART2_RX				AF3
#define PA15_SPI1_NSS				AF5
#define PA15_SPI3_NSS				AF6
#define PA15_USART3_RTS_DE			AF7
#define PA15_TSC_G3_IO1				AF9
#define PA15_SWPMI1_SUSPEND			AF12





#define PB0_TIM1_CH2N				AF1
#define PB0_SPI1_NSS				AF5
#define PB0_USART3_CK				AF7
#define PB0_QUADSPI_BK1_IO1			AF10
#define PB0_COMP1_OUT				AF12
#define PB0_SAI1_EXTCLK				AF13

#define PB1_TIM1_CH3N				AF1
#define PB1_USART3_RTS_DE			AF7
#define PB1_LPUART1_RTS_DE			AF8
#define PB1_QUADSPI_BK1_IO0			AF10
#define PB1_LPTIM2_IN1				AF14

#define PB2_RTC_OUT					AF0
#define PB2_LPTIM1_OUT				AF1
#define PB2_I2C3_SMBA				AF4

#define PB3_JTDO_TRACESWO			AF0
#define PB3_TIM2_CH2				AF1
#define PB3_SPI1_SCK				AF5
#define PB3_SPI3_SCK				AF6
#define PB3_USART1_RTS_DE			AF7
#define PB3_SAI1_SCK_B				AF13

#define PB4_NJTRST					AF0
#define PB4_I2C3_SDA				AF4
#define PB4_SPI1_MISO				AF5
#define PB4_SPI3_MISO				AF6
#define PB4_USART1_CTS				AF7
#define PB4_TSC_G2_IO1				AF9
#define PB4_SAI1_MCLK_B				AF13

#define PB5_LPTIM1_IN1				AF1
#define PB5_I2C1_SMBA				AF4
#define PB5_SPI1_MOSI				AF5
#define PB5_SPI3_MOSI				AF6
#define PB5_USART1_CK				AF7
#define PB5_TSC_G2_IO2				AF9
#define PB5_COMP2_OUT				AF12
#define PB5_SAI1_SD_B				AF13
#define PB5_TIM16_BKIN				AF14

#define PB6_LPTIM1_ETR				AF1
#define PB6_I2C1_SCL				AF4
#define PB6_USART1_TX				AF7
#define PB6_TSC_G2_IO3				AF9
#define PB6_SAI1_FS_B				AF13
#define PB6_TIM16_CH1N				AF14

#define PB7_LPTIM1_IN2				AF1
#define PB7_I2C1_SDA				AF4
#define PB7_USART1_RX				AF7
#define PB7_TSC_G2_IO4				AF9

#define PB8_I2C1_SCL				AF4
#define PB8_CAN1_RX					AF9
#define PB8_SDMMC1_D4				AF12
#define PB8_SAI1_MCLK_A				AF13
#define PB8_TIM16_CH1				AF14

#define PB9_IR_OUT					AF1
#define PB9_I2C1_SDA				AF4
#define PB9_SPI2_NSS				AF5
#define PB9_CAN1_TX					AF9
#define PB9_SDMMC1_D5				AF12
#define PB9_SAI1_FS_A				AF13

#define PB10_TIM2_CH3				AF1
#define PB10_I2C2_SCL				AF4
#define PB10_SPI2_SCK				AF5
#define PB10_USART3_TX				AF7
#define PB10_LPUART1_RX				AF8
#define PB10_TSC_SYNC				AF9
#define PB10_QUADSPI_CLK			AF10
#define PB10_COMP1_OUT				AF12
#define PB10_SAI1_SCK_A				AF13

#define PB11_TIM2_CH4				AF1
#define PB11_I2C2_SDA				AF4
#define PB11_USART3_RX				AF7
#define PB11_LPUART1_TX				AF8
#define PB11_QUADSPI_BK1_NCS		AF10
#define PB11_COMP2_OUT				AF12

#define PB12_TIM1_BKIN				AF1
#define PB12_TIM1_BKIN_COMP2		AF3
#define PB12_I2C2_SMBA				AF4
#define PB12_SPI2_NSS				AF5
#define PB12_USART3_CK				AF7
#define PB12_LPUART1_RTS_DE			AF8
#define PB12_TSC_G1_IO1				AF9
#define PB12_SWPMI1_IO				AF12
#define PB12_SAI1_FS_A				AF13
#define PB12_TIM15_BKIN				AF14

#define PB13_TIM1_CH1N				AF1
#define PB13_I2C2_SCL				AF4
#define PB13_SPI2_SCK				AF5
#define PB13_USART3_CTS				AF7
#define PB13_LPUART1_CTS			AF8
#define PB13_TSC_G1_IO2				AF9
#define PB13_SWPMI1_TX				AF12
#define PB13_SAI1_SCK_A				AF13
#define PB13_TIM15_CH1N				AF14

#define PB14_TIM1_CH2N				AF1
#define PB14_I2C2_SDA				AF4
#define PB14_SPI2_MISO				AF5
#define PB14_USART3_RTS_DE			AF7
#define PB14_TSC_G1_IO3				AF9
#define PB14_SWPMI1_RX				AF12
#define PB14_SAI1_MCLK_A			AF13
#define PB14_TIM15_CH1				AF14

#define PB15_RTC_REFIN				AF0
#define PB15_TIM1_CH3N				AF1
#define PB15_SPI2_MOSI				AF5
#define PB15_TSC_G1_IO4				AF9
#define PB15_SWPMI1_SUSPEND			AF12
#define PB15_SAI1_SD_A				AF13
#define PB15_TIM15_CH2				AF14





#define PC0_LPTIM1_IN1				AF1
#define PC0_I2C3_SCL				AF4
#define PC0_LPUART1_RX				AF8
#define PC0_LPTIM2_IN1				AF14

#define PC1_LPTIM1_OUT				AF1
#define PC1_I2C3_SDA				AF4
#define PC1_LPUART1_TX				AF8

#define PC2_LPTIM1_IN2				AF1
#define PC2_SPI2_MISO				AF5

#define PC3_LPTIM1_ETR				AF1
#define PC3_SPI2_MOSI				AF5
#define PC3_SAI1_SD_A				AF13
#define PC3_LPTIM2_ETR				AF14

#define PC4_USART3_TX				AF7

#define PC5_USART3_RX				AF7

#define PC6_TSC_G4_IO1				AF9
#define PC6_SDMMC1_D6				AF12

#define PC7_TSC_G4_IO2				AF9
#define PC7_SDMMC1_D7				AF12

#define PC8_TSC_G4_IO3				AF9
#define PC8_SDMMC1_D0				AF12

#define PC9_TSC_G4_IO4				AF9
#define PC9_SDMMC1_D1				AF12

#define PC10_SPI3_SCK				AF6
#define PC10_USART3_TX				AF7
#define PC10_TSC_G3_IO2				AF9
#define PC10_SDMMC1_D2				AF12

#define PC11_SPI3_MISO				AF6
#define PC11_USART3_RX				AF7
#define PC11_TSC_G3_IO3				AF9
#define PC11_SDMMC1_D3				AF12

#define PC12_SPI3_MOSI				AF6
#define PC12_USART3_CK				AF7
#define PC12_TSC_G3_IO4				AF9
#define PC12_SDMMC1_CK				AF12







#define PD0_SPI2_NSS				AF5
#define PD0_CAN1_RX					AF9

#define PD1_SPI2_SCK				AF5
#define PD1_CAN1_TX					AF9

#define PD2_USART3_RTS_DE			AF7
#define PD2_TSC_SYNC				AF9
#define PD2_SDMMC1_CMD				AF12

#define PD3_SPI2_MISO				AF5
#define PD3_USART2_CTS				AF7
#define PD3_QUADSPI_BK2_NCS			AF10

#define PD4_SPI2_MOSI				AF5
#define PD4_USART2_RTS_DE			AF7
#define PD4_QUADSPI_BK2_IO0			AF10

#define PD5_USART2_TX				AF7
#define PD5_QUADSPI_BK2_IO1			AF10

#define PD6_USART2_RX				AF7
#define PD6_QUADSPI_BK2_IO2			AF10
#define PD6_SAI1_SD_A				AF13

#define PD7_USART2_CK				AF7
#define PD7_QUADSPI_BK2_IO3			AF10

#define PD8_USART3_TX				AF7

#define PD9_USART3_RX				AF7

#define PD10_USART3_CK				AF7
#define PD10_TSC_G6_IO1				AF9

#define PD11_USART3_CTS				AF7
#define PD11_TSC_G6_IO2				AF9
#define PD11_LPTIM2_ETR				AF14

#define PD12_USART3_RTS_DE			AF7
#define PD12_TSC_G6_IO3				AF9
#define PD12_LPTIM2_IN1				AF14

#define PD13_TSC_G6_IO4				AF9
#define PD13_LPTIM2_OUT				AF14







#define PE0_TIM16_CH1				AF14


#define PE2_TRACECK					AF0
#define PE2_TSC_G7_IO1				AF9
#define PE2_SAI1_MCLK_A				AF13

#define PE3_TRACED0					AF0
#define PE3_TSC_G7_IO2				AF9
#define PE3_SAI1_SD_B				AF13

#define PE4_TRACED1					AF0
#define PE4_TSC_G7_IO3				AF9
#define PE4_SAI1_FS_A				AF13

#define PE5_TRACED2					AF0
#define PE5_TSC_G7_IO4				AF9
#define PE5_SAI1_SCK_A				AF13

#define PE6_TRACED3					AF0
#define PE6_SAI1_SD_A				AF13

#define PE7_TIM1_ETR				AF1
#define PE7_SAI1_SD_B				AF13

#define PE8_TIM1_CH1N				AF1
#define PE8_SAI1_SCK_B				AF13

#define PE9_TIM1_CH1				AF1
#define PE9_SAI1_FS_B				AF13

#define PE10_TIM1_CH2N				AF1
#define PE10_TSC_G5_IO1				AF9
#define PE10_QUADSPI_CLK			AF10
#define PE10_SAI1_MCLK_B			AF13

#define PE11_TIM1_CH2				AF1
#define PE11_TSC_G5_IO2				AF9
#define PE11_QUADSPI_BK1_NCS		AF10

#define PE12_TIM1_CH3N				AF1
#define PE12_SPI1_NSS				AF5
#define PE12_TSC_G5_IO3				AF9
#define PE12_QUADSPI_BK1_IO0		AF10

#define PE13_TIM1_CH3				AF1
#define PE13_SPI1_SCK				AF5
#define PE13_TSC_G5_IO4				AF9
#define PE13_QUADSPI_BK1_IO1		AF10

#define PE14_TIM1_CH4				AF1
#define PE14_TIM1_BKIN2				AF2
#define PE14_TIM1_BKIN2_COMP2		AF3
#define PE14_SPI1_MISO				AF5
#define PE14_QUADSPI_BK1_IO2		AF10

#define PE15_TIM1_BKIN				AF1
#define PE15_TIM1_BKIN_COMP1		AF3
#define PE15_SPI1_MOSI				AF5
#define PE15_QUADSPI_BK1_IO3		AF10


